### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [ ]:
Data Trends:
    
    1. Age group 20-24 is by far the most represented age group.
    2. Age group 30-34 had the highest average purchase per person, maybe reflecting the availability of more disp[osable income.
    3. The "other" demographic is the smallest, but it had the highest average purchase per person.

In [3]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data_df = pd.read_csv(file)

In [4]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [5]:
unique_players = len(purchase_data_df["SN"].unique())

unique_players

576

## Purchasing Analysis (Total)

In [160]:
unique_items = len(purchase_data_df["Item Name"].unique())

unique_items

179

In [7]:
item_occurrences = purchase_data_df['Item Name'].value_counts()

item_occurrences

Final Critic                                    13
Oathbreaker, Last Hope of the Breaking Storm    12
Fiery Glass Crusader                             9
Extraction, Quickblade Of Trembling Hands        9
Persuasion                                       9
                                                ..
The Decapitator                                  1
Exiled Mithril Longsword                         1
Alpha, Reach of Ending Hope                      1
Riddle, Tribute of Ended Dreams                  1
Betrayer                                         1
Name: Item Name, Length: 179, dtype: int64

In [8]:
average_purchase_price = purchase_data_df['Price'].mean()

average_purchase_price

3.050987179487176

In [9]:
total_purchases = purchase_data_df['Purchase ID'].count()

total_purchases

780

In [10]:
total_revenue = purchase_data_df['Price'].sum()

total_revenue

2379.77

In [11]:
summary_df = pd.DataFrame ({"Unique Items": [unique_items],
                           "Average Purchase Price": [average_purchase_price],
                            "Total Purchases": [total_purchases],
                           "Total Revenue": [total_revenue]})

summary_df['Average Purchase Price'] = summary_df['Average Purchase Price'].round(2)

summary_df

   Unique Items  Average Purchase Price  Total Purchases  Total Revenue
0           179                    3.05              780        2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [12]:
gender_count = purchase_data_df['Gender'].count()

gender_count

780

In [299]:
male_df = purchase_data_df.loc[purchase_data_df["Gender"] == "Male"]

In [300]:
female_df = purchase_data_df.loc[purchase_data_df["Gender"] =="Female"]

In [13]:
male_count = (purchase_data_df['Gender'].values =='Male').sum()

male_count

652

In [165]:
unique_male_purchasers = len(male_df["SN"].unique())

unique_male_purchasers

484

In [167]:
male_percentage = '{0:.2f}'.format((unique_male_purchasers/unique_players * 100))

male_percentage

'84.03'

In [15]:
female_count = (purchase_data_df['Gender'].values =='Female').sum()

female_count

113

In [171]:
unique_female_purchasers = len(female_df["SN"].unique())

unique_female_purchasers

81

In [172]:
female_percentage = '{0:.2f}'.format((unique_female_purchasers/unique_players * 100))

female_percentage

'14.06'

In [301]:
other_df = purchase_data_df.loc[purchase_data_df["Gender"] =='Other / Non-Disclosed']

In [123]:
other_count = (purchase_data_df['Gender'].values =='Other / Non-Disclosed').sum()

other_count

15

In [174]:
unique_other_purchasers = len(other_df["SN"].unique())

unique_other_purchasers

11

In [175]:
other_percentage = '{0:.2f}'.format((unique_other_purchasers/unique_players * 100))

other_percentage

'1.91'

In [176]:
gender_demo = {'Gender': ['Male', 'Female', 'Other'], 'Total Count': [unique_male_purchasers, unique_female_purchasers, unique_other_purchasers], 'Percentage of Players': [male_percentage,female_percentage, other_percentage]}
gender_demo

{'Gender': ['Male', 'Female', 'Other'],
 'Total Count': [484, 81, 11],
 'Percentage of Players': ['84.03', '14.06', '1.91']}

In [177]:
gender_demo_df = pd.DataFrame(gender_demo,columns=['Gender', 'Total Count', 'Percentage of Players'])

gender_demo_df

   Gender  Total Count Percentage of Players
0    Male          484                 84.03
1  Female           81                 14.06
2   Other           11                  1.91


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [178]:
male_purchase_count = male_df['Purchase ID'].count()
male_purchase_count

652

In [179]:
unique_male_purchasers = len(male_df["SN"].unique())
unique_male_purchasers

484

In [180]:
most_frequent_male_purchaser = male_df['SN'].value_counts()
most_frequent_male_purchaser

Lisosia93       5
Iral74          4
Idastidru52     4
Strithenu87     3
Zontibe81       3
               ..
Lisilsa62       1
Tyeoralru41     1
Marassa62       1
Lisast98        1
Sondilsaya62    1
Name: SN, Length: 484, dtype: int64

In [181]:
male_average_purchase_price = male_df['Price'].mean()
male_average_purchase_price

3.0178527607361953

In [182]:
male_total_purchase_value = male_df['Price'].sum()
male_total_purchase_value

1967.64

In [183]:
male_avg_total_per_person = male_total_purchase_value / unique_male_purchasers

male_avg_total_per_person

4.065371900826446

In [184]:
female_purchase_count = female_df['Purchase ID'].count()
female_purchase_count

113

In [185]:
unique_female_purchasers = len(female_df["SN"].unique())
unique_female_purchasers

81

In [186]:
most_frequent_female_purchaser = female_df['SN'].value_counts()
most_frequent_female_purchaser

Chamjask73     3
Yathecal82     3
Phyali88       3
Ialallo29      3
Tyidaim51      3
              ..
Quanunwen42    1
Maradaran90    1
Lisotesta51    1
Aethedru70     1
Layjask75      1
Name: SN, Length: 81, dtype: int64

In [187]:
female_average_purchase_price = female_df['Price'].mean()
female_average_purchase_price

3.203008849557519

In [188]:
female_total_purchase_value = female_df['Price'].sum()
female_total_purchase_value

361.94

In [189]:
female_avg_total_per_person = female_total_purchase_value / unique_female_purchasers

female_avg_total_per_person

4.468395061728395

In [190]:
other_average_purchase_price = other_df['Price'].mean()
other_average_purchase_price

3.3460000000000005

In [191]:
other_total_purchase_value = other_df['Price'].sum()
other_total_purchase_value

50.19

In [192]:
unique_other_purchasers = len(other_df["SN"].unique())
unique_other_purchasers

11

In [193]:
other_avg_total_per_person = other_total_purchase_value / unique_other_purchasers

other_avg_total_per_person

4.5627272727272725

In [156]:
gender_info = {'Gender': ['Male', 'Female', 'Other'], 'Average Purchase Price': [male_average_purchase_price, female_average_purchase_price, other_average_purchase_price ], 'Total Purchase Value': [male_total_purchase_value, female_total_purchase_value, other_total_purchase_value], 'Average Total Purchase Per Person': [male_avg_total_per_person, female_avg_total_per_person, other_avg_total_per_person]}
gender_info

{'Gender': ['Male', 'Female', 'Other'],
 'Average Purchase Price': [3.0178527607361953,
  3.203008849557519,
  3.3460000000000005],
 'Total Purchase Value': [1967.64, 361.94, 50.19],
 'Average Total Purchase Per Person': [4.065371900826446,
  4.468395061728395,
  4.5627272727272725]}

In [158]:
gender_info_df = pd.DataFrame(gender_info,columns=['Gender', 'Average Purchase Price', 'Total Purchase Value', 'Average Total Purchase Per Person'])
gender_info_df

,Gender,Average Purchase Price,Total Purchase Value,Average Total Purchase Per Person
0,Male,3.017853,1967.64,4.065372
1,Female,3.203009,361.94,4.468395
2,Other,3.346000,50.19,4.562727

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [31]:
purchase_data_df["Age"].max()

45

In [32]:
purchase_data_df["Age"].min()

7

In [203]:
bins = [0, 9.90, 14.90, 19.90, 24.90, 29.90, 34.90, 39.90, 99999]

In [204]:
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [205]:
age_bin = pd.cut(purchase_data_df["Age"], bins, labels=group_names)
age_bin

0      20-24
1        40+
2      20-24
3      20-24
4      20-24
       ...
775    20-24
776    20-24
777    20-24
778      <10
779    20-24
Name: Age, Length: 780, dtype: category
Categories (8, object): ['<10' < '10-14' < '15-19' < '20-24' < '25-29' < '30-34' < '35-39' < '40+']

In [206]:
age_bins_df = pd.DataFrame(age_bin)
age_bins_df

       Age
0    20-24
1      40+
2    20-24
3    20-24
4    20-24
..     ...
775  20-24
776  20-24
777  20-24
778    <10
779  20-24

[780 rows x 1 columns]

In [244]:
players = purchase_data_df.drop_duplicates(subset ='SN').groupby(['Age Group'])
players = players['SN'].count()
players

Age Group
0-10      17
9-14      22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40-45     12
Name: SN, dtype: int64

In [245]:
players.sum()

576

In [246]:
total_players = age_group_count.sum()

total_players

780

In [247]:
age_group_count_df = pd.DataFrame(players)
age_group_count_df

            SN
Age Group
0-10        17
9-14        22
15-19      107
20-24      258
25-29       77
30-34       52
35-39       31
40-45       12

In [248]:
age_group_count_df.columns = ['Total Count']
age_group_count_df

           Total Count
Age Group
0-10                17
9-14                22
15-19              107
20-24              258
25-29               77
30-34               52
35-39               31
40-45               12

In [249]:
age_group_count_df['Total Count']

Age Group
0-10      17
9-14      22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40-45     12
Name: Total Count, dtype: int64

In [250]:
age_group_count_df["Percentage of Players"] = age_group_count_df["Total Count"]/age_group_count_df["Total Count"].sum()*100
age_group_count_df

           Total Count  Percentage of Players
Age Group
0-10                17               2.951389
9-14                22               3.819444
15-19              107              18.576389
20-24              258              44.791667
25-29               77              13.368056
30-34               52               9.027778
35-39               31               5.381944
40-45               12               2.083333

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [251]:
purchase_data_df["Age Group"] = pd.cut(purchase_data_df["Age"], bins, labels = group_names)
purchase_data_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group,Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24,20-24
...,...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24,20-24

In [253]:
age_purchase_data = purchase_data_df.groupby(['Age Group'])

purchase_count = age_purchase_data['Purchase ID'].count()
purchase_count

Age Group
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Purchase ID, dtype: int64

In [254]:
total_purchase = age_purchase_data['Price'].sum()
total_purchase

Age Group
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [256]:
players = purchase_data_df.drop_duplicates(subset ='SN').groupby(['Age Group'])
players = players['SN'].count()
players

Age Group
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: SN, dtype: int64

In [257]:
purchase_age = pd.DataFrame(age_purchase_data['Purchase ID'].count())
purchase_age

           Purchase ID
Age Group
<10                 23
10-14               28
15-19              136
20-24              365
25-29              101
30-34               73
35-39               41
40+                 13

In [258]:
purchase_age = purchase_age.rename(columns = {'Purchase ID':'Purchase Count'})
purchase_age

           Purchase Count
Age Group
<10                    23
10-14                  28
15-19                 136
20-24                 365
25-29                 101
30-34                  73
35-39                  41
40+                    13

In [259]:
purchase_age['Average Purchase Price'] = round((total_purchase/purchase_count),2)
purchase_age

           Purchase Count  Average Purchase Price
Age Group
<10                    23                    3.35
10-14                  28                    2.96
15-19                 136                    3.04
20-24                 365                    3.05
25-29                 101                    2.90
30-34                  73                    2.93
35-39                  41                    3.60
40+                    13                    2.94

In [260]:
purchase_age['Total Purchase Value'] = total_purchase
purchase_age

           Purchase Count  Average Purchase Price  Total Purchase Value
Age Group
<10                    23                    3.35                 77.13
10-14                  28                    2.96                 82.78
15-19                 136                    3.04                412.89
20-24                 365                    3.05               1114.06
25-29                 101                    2.90                293.00
30-34                  73                    2.93                214.00
35-39                  41                    3.60                147.67
40+                    13                    2.94                 38.24

In [261]:
purchase_age['Avg Total Purchase Per Person'] = round((total_purchase/players),2)
purchase_age

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase Per Person
Age Group,,,,
<10,23,3.35,77.13,4.54
10-14,28,2.96,82.78,3.76
15-19,136,3.04,412.89,3.86
20-24,365,3.05,1114.06,4.32
25-29,101,2.90,293.00,3.81
30-34,73,2.93,214.00,4.12
35-39,41,3.60,147.67,4.76
40+,13,2.94,38.24,3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [68]:
purchase_data_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40-45
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,0-10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [77]:
biggest_spender_count = purchase_data_df.groupby('SN').agg({'Price': ['count']})

In [78]:
biggest_spender_count.columns=['Total Count']

In [79]:
biggest_spender_count.sort_values('Total Count' , ascending=False).head()

             Total Count
SN
Lisosia93              5
Iral74                 4
Idastidru52            4
Asur53                 3
Inguron55              3

In [266]:
biggest_spender_total = purchase_data_df.groupby('SN').agg({'Price': ['count', 'mean', 'sum']})

In [267]:
biggest_spender_total.columns = biggest_spender_total.columns.droplevel(0)

In [271]:
biggest_spender = biggest_spender_total.sort_values(['count','mean'], ascending=False)

biggest_spender.head()

             count      mean    sum
SN
Lisosia93        5  3.792000  18.96
Idastidru52      4  3.862500  15.45
Iral74           4  3.405000  13.62
Chamjask73       3  4.610000  13.83
Iskadarya95      3  4.366667  13.10

In [270]:
biggest_spender.columns = ['Purchase Count', 'Average Purchase Price', 'Total Purchase Value']

biggest_spender.head()

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Iral74                    4                3.405000                 13.62
Chamjask73                3                4.610000                 13.83
Iskadarya95               3                4.366667                 13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [284]:
popular_items = purchase_data_df.groupby(['Item ID','Item Name']).agg({'Price': ['count','sum']})

In [285]:
popular_items.columns = popular_items.columns.droplevel(0)

In [286]:
popular_items_final = popular_items_sorted_by_count = popular_items.sort_values('count', ascending=False)

In [293]:
popular_items_final = popular_items_final.rename(columns = {'count':'Purchase Count'})
popular_items_final = popular_items_final.rename(columns = {'sum':'Total Purchase Value'})

In [294]:
popular_items_final.head()

,,Purchase Count,Total Purchase Value
Item ID,Item Name,,
92,Final Critic,13,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,50.76
145,Fiery Glass Crusader,9,41.22
132,Persuasion,9,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [289]:
profitable_items_sum = popular_items.sort_values('sum', ascending=False)

In [296]:
profitable_items_sum = profitable_items_sum.rename(columns = {'count':'Purchase Count'})
profitable_items_sum = profitable_items_sum.rename(columns = {'sum':'Total Purchase Value'})

In [298]:
profitable_items_sum.head()

,,Purchase Count,Total Purchase Value
Item ID,Item Name,,
92,Final Critic,13,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,50.76
82,Nirvana,9,44.10
145,Fiery Glass Crusader,9,41.22
103,Singed Scalpel,8,34.80